app/controllers/tickets_controller.rb

SELECT `tickets`.* FROM `tickets`
---
    def admin
        @tickets = Ticket.all

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 1 LIMIT 1
---
    def verify
        @ticket2 = Ticket.find(params[:id])

UPDATE `tickets` SET `tickets`.`solucion` = 'hey', `tickets`.`updated_at` = '2022-03-04 16:03:44.650756', `tickets`.`state` = 'assign_agent' WHERE `tickets`.`id` = 1
---
    def update
        if @tickets.update(ticket_params)

SELECT `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 1 LIMIT 1
---
    def find_ticket
        @tickets = Ticket.find(params[:id])